In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame({"Name": ["Abhinav" , "Cow" , "Cat" , "Dog" , "Black"]})

In [4]:
df

      Name
0  Abhinav
1      Cow
2      Cat
3      Dog
4    Black

In [23]:
from sklearn.preprocessing import LabelEncoder

In [24]:
le = LabelEncoder()
df["en"] = le.fit_transform(df["Name"])

In [25]:
df

      Name  en
0  Abhinav   0
1      Cow   3
2      Cat   2
3      Dog   4
4    Black   1